In [2]:
# 数据嵌套字典学习
import pandas as pd
import numpy as np

pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [4]:
fram3 = pd.DataFrame(pop)
fram3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [5]:
# 行列互换
fram3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [6]:
# 明确指定索引,没有的则为NULL
pd.DataFrame(pop,index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [14]:
# series 组成的字典也是一套用法,series 就是一组数据,加索引
pdata = {'Ohio': fram3['Ohio'][:-1],'Nevada': fram3['Nevada'][:2]}
pdata

{'Ohio': 2001    1.7
 2002    3.6
 Name: Ohio, dtype: float64, 'Nevada': 2001    2.4
 2002    2.9
 Name: Nevada, dtype: float64}

In [15]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [16]:
# 构造索引列名,构造成列名
fram3.index.name = 'year';
fram3.columns.name = 'state'
fram3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [17]:
fram3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [18]:
fram3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [20]:
obj = pd.Series(range(3),index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [22]:
index[2:]

Index(['c'], dtype='object')

In [23]:
# index对象是不可变的,因此用户不能对其进行修改，不可变可以使index在多个数据结构之间安全共享.
# 
index[1] = 'd'

TypeError: Index does not support mutable operations

In [24]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [25]:
obj2 = pd.Series([1.5,-2.5,0],index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [26]:
obj2.index is labels

True

In [27]:
# 注意：虽然用户不需要经常使用Index的功能，但是因为一些操作会生成包含被
# 索引化的数据，理解它们的工作原理是很重要的。
fram3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [28]:
fram3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [30]:
'Ohio' in fram3.columns

True

In [31]:
2003 in fram3.index

False

In [33]:
# 与python的集合不同，pandas的Index可以包含重复的标签：
dup_labels = pd.Index( ['foo','foo','bar','bar'] )
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')